viajantes/app/controllers/tips_controller.rb

  def index
  	@tourist_sight = TouristSight.find(params[:tourist_sight_id])
  	@city = @tourist_sight.city
    @tips = Tip.all
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)
SELECT * FROM "tips" WHERE ("tips".tourist_sight_id = 1)

  def show
    @tip = Tip.find(params[:id])
---
SELECT * FROM "tips" WHERE ("tips"."id" = 9)

  def edit
    @tip = Tip.find(params[:id])
---
SELECT * FROM "tips" WHERE ("tips"."id" = 8)

  def create
    @tip = Tip.new(params[:tip])
    @tip.tourist_sight = TouristSight.find(params[:tourist_sight_id])

    respond_to do |format|
      if @tip.save
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 2)
INSERT INTO "tips" ("name", "tourist_sight_id", "created_at", "updated_at", "description") VALUES(E'qadsasdasd', 2, '2009-07-07 00:27:48.364000', '2009-07-07 00:27:48.364000', E'asdasd') RETURNING "id"

  def update
    @tip = Tip.find(params[:id])

    respond_to do |format|
      if @tip.update_attributes(params[:tip])
---
SELECT * FROM "tips" WHERE ("tips"."id" = 20)
UPDATE "tips" SET "updated_at" = '2009-07-08 12:31:02.585164', "name" = E'Nova dica 2 alterada', "description" = E'descricao2' WHERE "id" = 22

  def destroy
    @tip = Tip.find(params[:id])
    @tip.destroy
---
SELECT * FROM "tips" WHERE ("tips".tourist_sight_id = 2)
DELETE FROM "tips" WHERE "id" = 8