viajantes/app/controllers/tourist_sight_tags_controller.rb

SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def index
  tourist_sight = TouristSight.find(params[:tourist_sight_id])

  @city = tourist_sight.city
  @tag = Tag.find(params[:tag_id])

SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)
SELECT * FROM "tags"
---
	def new
		@tourist_sight = TouristSight.find(params[:tourist_sight_id])
		@city = @tourist_sight.city
		@tags = Tag.all

SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)
SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
	def create
		tag_ids = params[:tag][:id]
		tourist_sight_id = params[:tourist_sight_id]
		@tourist_sight = TouristSight.find(tourist_sight_id)

		new_tags = []
		tag_ids.each do |id|
			new_tags << Tag.find(id)