viajantes/app/controllers/tourist_sights_controller.rb

  def index
    @tourist_sights = TouristSight.all
---
SELECT * FROM "tourist_sights"

  def show
    @tourist_sight = TouristSight.find(params[:id])
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)

  def edit
    @tourist_sight = TouristSight.find(params[:id])
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)

  def create
    @tourist_sight = TouristSight.new(params[:tourist_sight])

    respond_to do |format|
      if @tourist_sight.save
---
INSERT INTO "tourist_sights" ("name", "address", "created_at", "updated_at", "description", "state_id") VALUES(E'Catedral N. Sra Aparecida', E'Esplanada dos Ministérios', '2009-06-30 21:29:37.535747', '2009-06-30 21:29:37.535747', E'Uma catedral muito doida!', 20) RETURNING "id"

  def update
    @tourist_sight = TouristSight.find(params[:id])

    respond_to do |format|
      if @tourist_sight.update_attributes(params[:tourist_sight])
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 996332885)
UPDATE "tourist_sights" SET "updated_at" = '2009-07-01 01:38:10.102382', "city_id" = 2975, "state_id" = 20 WHERE "id" = 114

  def destroy
    @tourist_sight = TouristSight.find(params[:id])
    @tourist_sight.destroy
---
SELECT * FROM "tourist_sights" WHERE ("tourist_sights"."id" = 1)
DELETE FROM "tourist_sights" WHERE "id" = 1

	def load_states
		@states = State.find_all_by_country_id(1, :order => "name asc")
---
SELECT * FROM "states" WHERE ("states"."country_id" = 1) ORDER BY name asc

	def load_cities(state_id)
		@cities = City.find_all_by_state_id(state_id, :order => "name asc")
---
SELECT * FROM "cities" WHERE ("cities"."state_id" = E'23') ORDER BY name asc